app/Http/Controllers/PublicController.php

    public function getReports(Request $request) {
        $tbl = $this->getCurrentTable();
        $data = DB::table($tbl)
                ->join('sub_categories', 'sub_categories.sub_category_id', '=', $tbl . '.sub_category_id')
                ->join('regions', 'regions.region_id', '=', $tbl . '.region_id')
                ->select($tbl . '.*', 'sub_categories.sub_category_name', 'sub_categories.sub_category_image')
                ->orderBy('report_id', 'desc');
        $total_count = $data->count();
        $data = $data->take(10)->get();
        $sub_categories = $categories = SubCategory::all();
        $regions = Region::all();
---
select * from `sub_categories`
select * from `regions`

    public function getReportDetails($url) {
        $sub_categories = SubCategory::all();
---
select * from `sub_categories`

    public function getCurrentTable() {
        $table = DB::table('report_tables')->select('tablename', 'no_of_records')->where('status', 'inprogress')->first();
---
select `tablename`, `no_of_records` from `report_tables` where `status` = 'inprogress' limit 1